[
  "Do 100 squats.",
  "Show the most embarrassing photo on your phone.",
  "Give a foot massage to the person on your right.",
  "Say something dirty to the person on your left.",
  "Let the rest of the group DM someone from your Instagram account.",
  "Eat a banana without using your hands.",
  "Go twerk for a minute.",
  "Keep your eyes closed until it's your go again.",
  "Like the first 15 posts on your Facebook newsfeed.",
  "Send a sext to the last person in your phonebook.",
  "Keep three ice cubes in your mouth until they melt.",
  "Give a lap dance to someone of your choice.",
  "Yell out the first word that comes to your mind.",
  "Show off your orgasm face.",
  "Empty out your wallet/purse and show everyone what's inside.",
  "Show the last five people you texted and what the messages said.",
  "Try to put your whole fist in your mouth.",
  "Remove four items of clothing.",
  "Eat a spoonful of mustard.",
  "Put 10 different available liquids into a cup and drink it.",
  "Do your best impression of a baby being born.",
  "Try to lick your elbow.",
  "Pretend to be the person to your right for 10 minutes.",
  "Be someone's pet for the next 5 minutes.",
  "Try to drink a glass of water while standing on your hands.",
  "Do your best sexy crawl.",
  "Say two honest things about everyone else in the group.",
  "Put as many snacks into your mouth at once as you can.",
  "Try and make the group laugh as quickly as possible.",
  "Let someone shave part of your body.",
  "Tell everyone an embarrassing story about yourself.",
  "Post the oldest selfie on your phone on Instagram Stories.",
  "For a guy, put on makeup. For a girl, wash off your make up.",
  "Do four cartwheels in a row.",
  "Tell the saddest story you know.",
  "Belly dance like your life depended on it.",
  "Curse like sailor for 20 seconds straight.",
  "Dance without music for one minute.",
  "Pole dance with an imaginary pole.",
  "Let someone else tickle you and try not to laugh.",
  "Serenade the person to your right.",
  "Talk in an accent for the next 3 rounds.",
  "Make every person in the group smile, keep going until everyone has cracked a smile.",
  "Kiss the person to your left.",
  "Attempt to do a magic trick.",
  "Eat five tablespoons of a condiment.",
  "Attempt to breakdance for one minute.",
  "Let the group give you a new hairstyle.",
  "Take a shower with your clothes on.",
  "Break two eggs on your head.",
  "Sell a piece of trash to someone in the group using your best salesmanship.",
  "Attempt to walk on your hands for as far as you can.",
  "Imitate a celebrity every time you talk.",
  "Try to juggle 2 or 3 items of the group's choosing.",
  "Gargle something that shouldn't be gargled, but won't hurt you.",
  "Get slapped on the face by the person of your choosing.",
  "Spin an imaginary hula hoop around your waist for the rest of the round.",
  "Seduce a member of the same gender in the group.",
  "Compose a poem on the spot based on something the group comes up with.",
  "Poll dance for 1 minute with an imaginary pole.",
  "Choose someone from the group to give you a spanking.",
  "Post an extremely unflattering picture of yourself to the social media outlet of your choosing.",
  "Hold a funny face for the rest of the round.",
  "Drag your butt on the carpet like a dog from one end of the room to the other.",
  "Open a bag of snacks or candy using only your mouth, no hands or feet.",
  "Act like whatever animal someone yells out for the next 1 minute.",
  "Eat one teaspoon of the spiciest thing you have in the kitchen.",
  "Transfer an ice cube from your mouth to the person's mouth on your right.",
  "Call the 3rd contact on your phone and sing them 30 seconds of a song that the group chooses. No talking.",
  "Pretend to be a food. Don't pretend to eat the food. Keep pretending until someone guesses the food you are.",
  "Drop something in the toilet and then reach in to get it.",
  "Find the person whose first name has the same letter as your first name. Now lick their face.",
  "Sit in a spinning chair and have the group spin you for 30 seconds.",
  "Jump up and down as high as you can go for a full minute.",
  "Let two people give you a wet willy at the same time.",
  "Sing a praise song about a person of the groups choosing.",
  "Depict a human life through interpretive dance.",
  "Dance with no music for 1 minute.",
  "Write something embarrassing somewhere on your body with a permanent marker.",
  "Beg and plead the person to your right not to leave you for that other boy or girl.",
  "Put ice cubes down your pants.",
  "Stick your arm into the trash can past your elbow.",
  "Switch clothes with someone of the opposite sex in the group for three rounds.",
  "Let the group pose you in an embarrassing position and take a picture.",
  "Give someone your phone and let them send one text to anyone in your contacts.",
  "Let the group look through your phone for one minute.",
  "Drink a small cup of a concoction that the group makes.",
  "Let the person to your left draw on your face with a pen.",
  "Imitate popular YouTube videos until someone can guess the video you are imitating.",
  "Make up a 30-second opera about a person or people in the group and perform it.",
  "Do pushups until you can't do any more, wait 5 seconds, and then do one more."
]