[
  "When was the last time you peed in bed?",
  "What is the biggest lie you have ever told?",
  "Tell us your most embarrassing vomit story.",
  "Have you ever made out with someone here?",
  "Have you ever cheated or been cheated on?",
  "What are your top three turn-ons?",
  "What is your deepest darkest fear?",
  "What is the most childish thing you still do?",
  "What is something your friends would never expect that you do?",
  "Who is the person you most regret kissing?",
  "When was the last time you lied?",
  "Who was the last person you licked?",
  "What is the most embarrassing picture of you?",
  "What's the most embarrassing thing you've ever done?",
  "Have you ever broken the law?",
  "Do you have any fetishes?",
  "What's the worst thing you've ever done?",
  "What's the worst thing you've ever said to anyone?",
  "What's the biggest misconception about you?",
  "What's a secret you've never told anyone?",
  "What would you do if you were the opposite sex for a week?",
  "What's the worst time you let someone take the blame for something you did?",
  "What do most people think is true about you, but isn't?",
  "What's your biggest regret?",
  "What are your thoughts on polyamory?",
  "What is the biggest thing you've gotten away with?",
  "Why did you break up with your last boyfriend or girlfriend?",
  "What is the most embarrassing series of texts you have on your phone?",
  "When was the last time you cried?",
  "What's your biggest fantasy?",
  "Tell me about your first kiss",
  "What is the most embarrassing thing in your room?",
  "What was the most awkward romantic encounter you have had?",
  "Do you have a hidden talent?",
  "What is the stupidest thing you have ever done?",
  "What pictures or videos of you do you wish didn't exist?",
  "What is your biggest regret?",
  "Tell the group who your crush is.",
  "Tell me about your most awkward date.",
  "What is the naughtiest thing you've done in public?",
  "What is the most expensive thing you have stolen?",
  "What's something you're glad your mum doesn't know about you?",
  "Who was your first celebrity crush?",
  "What's the worst intimate experience you've ever had?",
  "Have you ever cheated in an exam?",
  "What's the drunkest you've ever been?",
  "What is the silliest thing you have an emotional attachment to?",
  "What's the biggest mistake you've ever made?",
  "What's the most disgusting thing you've ever done?",
  "Who would you like to kiss in this room?",
  "Where's the weirdest place you've had sex?",
  "What's the worst thing anyone's ever done to you?",
  "What's your worst habit?",
  "What's the strangest dream you've had?",
  "Have you ever been caught doing something you shouldn't have?",
  "What's the worst date you've been on?",
  "Have you ever lied to get out of a bad date?",
  "Have you ever peed in the shower?",
  "Have you ever shit yourself since you were a child?",
  "What is the most embarrassing thing your parents have caught you doing?",
  "What's the most trouble you've been in?",
  "Who is the sexiest person here?",
  "When was the most inappropriate time you farted?",
  "What is the scariest dream you have ever had?",
  "What is the grossest thing that has come out of your body?",
  "What is your favourite thing that your boyfriend or girlfriend does?",
  "Who have you loved but they didn't love you back?",
  "If you starred in a romance, what would it be like?",
  "What was the cruellest joke you played on someone?",
  "What is the most embarrassing thing you have put up on social media?",
  "What is the grossest thing you have had in your mouth?",
  "What is the most embarrassing nickname you have ever had?",
  "Describe your most recent romantic encounter in detail.",
  "What is the weirdest thing you have done for a boyfriend or girlfriend?",
  "Is it true that you (whatever you or the group suspects they do/did)?",
  "What do you really hope your parents never find out about?",
  "Tell me something you don't want me to know.",
  "What have you done that people here would judge you most for doing?",
  "What is something that you have never told anyone?",
  "What is the most disgusting habit you have?",
  "What's the most embarrassing thing you've ever done?",
  "Have you ever broken the law? If so, why?",
  "What is your biggest pet peeve?",
  "What's the worst date you've been on?",
  "What's the best date you've been on?",
  "What is your favorite movie that you secretly know is actually terrible?",
  "What was the last time you've laughed the hardest?",
  "What's the most childish thing you still do?",
  "What is the most gross thing you have done today?",
  "What was your best moment in life so far?",
  "Who has the best sense of humor in this room?",
  "What's the most embarrassing music you listen to?",
  "What is the weirdest trend you've ever participated in?",
  "What's the last thing you Googled?",
  "What's the most adventurous thing you've ever done?",
  "Who's the last person you searched on Instagram?",
  "What's the drunkest you've ever been?",
  "Do you ever talk to yourself in the mirror?",
  "What is the weirdest thing you've ever bought?",
  "What's the last lie you told?",
  "What was the most embarrassing thing you've ever done on a date?",
  "Have you ever accidentally hit something (or someone!) with your car?",
  "Name someone you've pretended to like but actually couldn't stand",
  "What's your most bizarre nickname?",
  "What's been your most physically painful experience?",
  "What bridges are you glad that you burned?",
  "What's the craziest thing you've done on public transportation?",
  "If you met a genie, what would your three wishes be?",
  "What's the meanest thing you've ever said to someone else?",
  "Who was your worst kiss ever?",
  "What's one thing you'd do if you knew there no consequences?",
  "What's the craziest thing you've done in front of a mirror?",
  "What's the meanest thing you've ever said about someone else?",
  "What's something you do with your friends that you'd never do with your partner?",
  "Who are you most jealous of?",
  "What do your favorite pajamas look like?",
  "Have you ever faked sick to get out of a party?",
  "Who's the oldest person you've dated?",
  "How many selfies do you take a day?",
  "Meatloaf says he'd do anything for love, but he won't do “that",
  "How many times a week do you wear the same pants?",
  "Would you date your high school crush today?",
  "Where are you ticklish?",
  "Do you believe in any superstitions? If so, which ones?",
  "What's one movie you're embarrassed to admit you enjoy?",
  "What's your most embarrassing grooming habit?",
  "When's the last time you apologized? What for?",
  "How do you really feel about the Twilight saga?",
  "Where do most of your embarrassing odors come from?",
  "Have you ever considered cheating on a partner?",
  "Have you ever cheated on a partner?",
  "Have you ever peed in a pool?",
  "What's the weirdest place you've ever grown hair?",
  "If you were guaranteed to never get caught, who on Earth would you murder?",
  "What's the cheapest gift you've ever gotten for someone else?",
  "What app do you waste the most time on?",
  "What's the weirdest thing you've done on a plane?",
  "Have you ever been nude in public?",
  "How many gossip blogs do you read a day?",
  "What is the youngest age partner you'd date?",
  "Have you ever picked your nose in public?",
  "Have you ever lied about your age?",
  "If you had to delete one app from your phone, which one would it be?",
  "What's your most embarrassing late night purchase?",
  "What's the longest you've gone without showering?",
  "Have you ever used a fake ID?",
  "Which of your family members annoys you the most and why?",
  "What is your greatest fear in a relationship?",
  "What's your biggest pet peeve about the person to your left?",
  "What's the most embarrassing text in your phone right now?",
  "Have you ever seen a dead body?",
  "What celebrity do you think is overrated?",
  "Have you ever lied to your boss?",
  "Have you ever stolen something from work?",
  "What's the longest you've gone without brushing your teeth?",
  "What's your biggest regret in life?",
  "Who would you hate to see naked?",
  "Describe the weirdest thing you've ever done while inebriated",
  "Have you ever regifted a present?",
  "Would you break up with your partner for $1 million?",
  "Have you ever had a crush on a coworker?",
  "Do you still have feelings for any of your exes?",
  "What's the smallest tip you've ever left at a restaurant?",
  "Have you ever regretted something you did to get a crush or partner's attention?",
  "What's one job you could never do?",
  "Have you ever ghosted a friend?",
  "Have you ever ghosted a partner?",
  "What's the most scandalous photo in your cloud?"
]