[
  "When was the last time you peed in bed?",
  "What is the biggest lie you have ever told?",
  "Tell us your most embarrassing vomit story.",
  "Have you ever made out with someone here?",
  "Have you ever cheated or been cheated on?",
  "What are your top three turn-ons?",
  "What is your deepest darkest fear?",
  "What is the most childish thing you still do?",
  "What is something your friends would never expect that you do?",
  "Who is the person you most regret kissing?",
  "When was the last time you lied?",
  "Who was the last person you licked?",
  "What is the most embarrassing picture of you?",
  "What's the most embarrassing thing you've ever done?",
  "Have you ever broken the law?",
  "Do you have any fetishes?",
  "What's the worst thing you've ever done?",
  "What's the worst thing you've ever said to anyone?",
  "What's the biggest misconception about you?",
  "What's a secret you've never told anyone?",
  "What would you do if you were the opposite sex for a week?",
  "What's the worst time you let someone take the blame for something you did?",
  "What do most people think is true about you, but isn't?",
  "What's your biggest regret?",
  "What are your thoughts on polyamory?",
  "What is the biggest thing you've gotten away with?",
  "Why did you break up with your last boyfriend or girlfriend?",
  "What is the most embarrassing series of texts you have on your phone?",
  "When was the last time you cried?",
  "What's your biggest fantasy?",
  "Tell me about your first kiss",
  "What is the most embarrassing thing in your room?",
  "What was the most awkward romantic encounter you have had?",
  "Do you have a hidden talent?",
  "What is the stupidest thing you have ever done?",
  "What pictures or videos of you do you wish didn't exist?",
  "What is your biggest regret?",
  "Who is your crush?",
  "Tell me about your most awkward date.",
  "What is the naughtiest thing you've done in public?",
  "What is the most expensive thing you have stolen?",
  "What's something you're glad your mum doesn't know about you?",
  "What is something that people think you would never be into, but you are?",
  "Who was your first celebrity crush?",
  "What's the worst intimate experience you've ever had?",
  "Have you ever cheated in an exam?",
  "What's the drunkest you've ever been?",
  "What is the silliest thing you have an emotional attachment to?",
  "What's the biggest mistake you've ever made?",
  "What's the most disgusting thing you've ever done?",
  "Who would you like to kiss in this room?",
  "Where's the weirdest place you've had sex?",
  "What's the worst thing anyone's ever done to you?",
  "What's your worst habit?",
  "What's the strangest dream you've had?",
  "Have you ever been caught doing something you shouldn't have?",
  "What's the worst date you've been on?",
  "Have you ever lied to get out of a bad date?",
  "Have you ever peed in the shower?",
  "Have you ever shit yourself since you were a child?",
  "What is the most embarrassing thing your parents have caught you doing?",
  "What's the most trouble you've been in?",
  "Who is the sexiest person here?",
  "What secret about yourself did you tell someone in confidence and then they told a lot of other people?",
  "When was the most inappropriate time you farted?",
  "What is the scariest dream you have ever had?",
  "What is the grossest thing that has come out of your body?",
  "What is your favourite thing that your boyfriend or girlfriend does?",
  "Who have you loved but they didn't love you back?",
  "If you starred in a romance, what would it be like?",
  "What was the cruellest joke you played on someone?",
  "What is the most embarrassing thing you have put up on social media?",
  "What is the grossest thing you have had in your mouth?",
  "Tell me about the last time someone unexpectedly walked in on you while you were naked.",
  "What is the most embarrassing nickname you have ever had?",
  "Describe your most recent romantic encounter in detail.",
  "What is the weirdest thing you have done for a boyfriend or girlfriend?",
  "Is it true that you (whatever you or the group suspects they do/did)?",
  "When was the last time you wiped a booger off on something that shouldn't have boogers on it?",
  "What do you really hope your parents never find out about?",
  "Tell me something you don't want me to know.",
  "What have you done that people here would judge you most for doing?",
  "What is something that you have never told anyone?",
  "What is the most disgusting habit you have?"
]